notes/2016/02/02/easy_install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>easy_install</title>
<!-- 2016-02-02 二 23:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="FangQian" />
<meta  name="keywords" content="python" />
</head>
<body>
<div id="content">
<h1 class="title">easy_install</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. python easy_install的安装和使用</a>
<ul>
<li><a href="#sec-1-1">1.1. 意义何在？</a></li>
<li><a href="#sec-1-2">1.2. 常见的问题</a></li>
</ul>
</li>
<li><a href="#sec-2">2. pip</a>
<ul>
<li><a href="#sec-2-1">2.1. pip介绍</a></li>
<li><a href="#sec-2-2">2.2. pip的使用</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> python easy_install的安装和使用</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 意义何在？</h3>
<div class="outline-text-3" id="text-1-1">
<p>
正常情况下，我们要给Python安装第三方的扩展包，我们必须下载压缩包，解压到一个目录，然后在命令行或者终端打开这个目录，然后
执行python setup.py install 来进行安装。这样太繁琐了，我们可以直接在命令行执行easy_install Twisted,这样就轻松的把最新版的
Twisted包装上去了
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 常见的问题</h3>
<div class="outline-text-3" id="text-1-2">
<p>
当在安装包的时候，不管是手动安装，还是easy_install,如果提示错误：找不到python文件，那说明我们安装的python不是开发版，在
ubuntu下面的解决办法如下,
</p>
<pre class="example">
sudo apt-get install python-2.7-dev
</pre>
<p>
安装对应python版本的dev就可以了
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> pip</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> pip介绍</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Pip 是安装python包的工具，提供了安装包，升级包以及卸载包的功能。
pip是对easy_install的取代，提供了和easy_install相同的查找包的功能，因此可以使用easy_install安装的包同样也可以使用pip进行安装
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> pip的使用</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>安装package
</li>
</ul>
<pre class="example">
pip install package-name
</pre>
<ul class="org-ul">
<li>列出安装的package
</li>
</ul>
<pre class="example">
pip freeze
</pre>
<ul class="org-ul">
<li>安装特定版本的package
</li>
</ul>
<p>
通过使用==,&gt;=,&lt;=,&gt;,&lt;
</p>
<pre class="example">
$ pip install 'package-name&lt;2.0'
$ pip install 'package-name&gt;2.0,&lt;3.0'
</pre>
<ul class="org-ul">
<li>升级包
</li>
</ul>
<p>
升级包到当前最新版本，可以使用-U 或者 &#x2013;upgrade
</p>
<pre class="example">
$ pip install -U package-name
</pre>
<ul class="org-ul">
<li>卸载包
</li>
</ul>
<pre class="example">
$ pip uninstall package-name
</pre>
<ul class="org-ul">
<li>查询包
</li>
</ul>
<p>
pip search package-name
</p>
<pre class="example">
#pip --help
Usage
  pip &lt;command&gt; [options]
Commands:
  install          安装包
  uninstall        卸载包
  freeze           按照一定格式输出已安装列表
　list             列出已安装的包
  show             显示包的详细信息
  search           搜索包，类似yum里的search
  wheel            Bulid wheels from your requirements
  help             当前帮助
General Options:
  -h  --help       显示帮助
  -v  --verbose    更多的输出，最多可以使用3次
  -V  --version    显示版本信息然后退出
  -q  --quiet      最少的输出
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#26399;: 2016/02/02</p>
<p class="author">&#20316;&#32773;: FangQian</p>
<p class="date">Created: 2016-02-02 二 23:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
